STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
/**
  ******************************************************************************
  * @file    stm32u5xx_usb_drd_core.c
  * @brief   USB DRD Core driver.
  *
  *          This file provides firmware functions to manage the following
  *          functionalities of the USB Peripheral Controller:
  *           + Initialization/de-initialization functions
  *           + I/O operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                    ##### How to use this driver #####
  ==============================================================================
    [..]
      (#) Fill parameters of peripheral configuration structure.

      (#) Call USB_DRD_InitCore() API to initialize the USB Core peripheral.

      (#) The upper HAL HCD/PCD driver will call the right routines for its internal processes.

  @endverbatim

  ******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_usb_drd_core.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */
#if defined (USB_DRD_FS)
/** @addtogroup USB_DRD_CORE USB DRD CORE
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static uint16_t  phy_chin_state[USB_DRD_MAX_CHEP_NBR];  /*!< Physical Channel in State (Used/Free) */
static uint16_t  phy_chout_state[USB_DRD_MAX_CHEP_NBR]; /*!< Physical Channel out State (Used/Free) */
static uint32_t  PMALookupTable[PMA_BLOCKS]; /*!< PMA LookUp Table */

static usb_drd_ep_config_t chep0; /*!< host channel Endpoint0 configuration */
static usb_drd_ep_db_config_t ep_db_state; /*!< Endpoint double buffer state */

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/** @defgroup USB_DRD_CORE_Private_Functions USB Core Low Layer Private Functions
  * @{
  */
static usb_core_status_t USB_DRD_ResetCore(uint32_t instance);

static usb_core_status_t USB_DRD_CH_BULK_DB_StartXfer(uint32_t instance, usb_core_ch_t *p_ch,
                                                      uint32_t ch_reg, uint32_t *p_length);

static usb_core_status_t USB_DRD_CH_ISO_DB_StartXfer(uint32_t instance, usb_core_ch_t *p_ch,
                                                     uint32_t size_byte);

static uint8_t USB_DRD_IsUsedChannel(usb_core_channel_t ch_num);
static usb_core_phy_ch_t USB_DRD_GetFreePhysicalChannel(const usb_core_ch_t *p_ch);
static uint16_t USB_DRD_GetFreePMA(uint16_t mps);
static usb_core_status_t USB_DRD_PMAFree(uint32_t pma_base, uint16_t mps);
static usb_core_status_t USB_DRD_PMAlloc(usb_core_ch_t *p_ch, uint16_t ch_kind);
static usb_core_status_t USB_DRD_PMADeAlloc(usb_core_ch_t *p_ch);
/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @addtogroup USB_DRD_CORE_Private_Functions USB Core Low Layer Private Functions
  * @{
  */

/**
  * @brief  Reset the USB Core (needed after USB clock settings change)
  * @param  instance Selected device
  * @retval HAL status
  */
static usb_core_status_t USB_DRD_ResetCore(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Disable Host Mode */
  p_usb->CNTR &= ~USB_CNTR_HOST;

  /* Force Reset IP */
  p_usb->CNTR |= USB_CNTR_USBRST;

  return USB_CORE_OK;
}

/**
  * @brief  Start Transfer of Channel bulk out double buffer.
  * @param  instance Selected device.
  * @param  p_ch pointer to Host Channel structure.
  * @param  ch_reg snapshot of the CHEPR register.
  * @param  p_length Transfer Length pointer.
  * @retval DRD Core status
  */
static usb_core_status_t USB_DRD_CH_BULK_DB_StartXfer(uint32_t instance, usb_core_ch_t *p_ch,
                                                      uint32_t ch_reg, uint32_t *p_length)
{
  /* Double Buffer Management */
  if (p_ch->xfer_size > p_ch->max_packet)
  {
    /* Enable double buffer mode */
    (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_BULK_DB_ENBALE);
    *p_length = p_ch->max_packet;
    p_ch->xfer_size -= *p_length;

    /* Prepare two buffer before enabling host */
    if ((ch_reg & USB_CH_DTOG_TX) == 0U)
    {
      /* Write Buffer0 */
      USB_DRD_SET_CHEP_DBUF0_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)*p_length);
      USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr0, (uint16_t)*p_length);
    }
    else
    {
      /* Write Buffer1 */
      USB_DRD_SET_CHEP_DBUF1_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)*p_length);
      USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr1, (uint16_t)*p_length);
    }

    p_ch->p_xfer_buffer += *p_length;

    /* Multi packet transfer */
    if (p_ch->xfer_size > p_ch->max_packet)
    {
      p_ch->xfer_size -= *p_length;
    }
    else
    {
      *p_length = p_ch->xfer_size;
      p_ch->xfer_size = 0U;
    }

    if ((ch_reg & USB_CH_DTOG_TX) == 0U)
    {
      /* Write Buffer1 */
      USB_DRD_SET_CHEP_DBUF1_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)*p_length);
      USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr1, (uint16_t)*p_length);
    }
    else
    {
      /* Write Buffer0 */
      USB_DRD_SET_CHEP_DBUF0_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_IN_DIR, (uint16_t)*p_length);
      USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_addr0, (uint16_t)*p_length);
    }
  }
  else
  {
    /* Disable bulk double buffer mode */
    (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_BULK_DB_DISABLE);

