STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
  /* Check if we need remaining Block */
  if ((mps_t % 8U) != 0U)
  {
    nbr_req_blocks++;
  }

  /* Look For nbr_req_blocks * Empty Block */
  for (uint8_t i = 0U; ((i < PMA_BLOCKS) && (free_blocks != nbr_req_blocks)); i++)
  {
    entry = PMALookupTable[i];

    /* Check the first col to look for a contiguous block */
    if ((free_blocks != 0U) && ((entry & (uint32_t)1U) != 0U))
    {
      free_blocks = 0U;
    }
    uint8_t j = 0U;
    while ((j <= 31U) && (free_blocks != nbr_req_blocks))
    {
      /* Check if block j is free */
      if ((entry & ((uint32_t)1U << j)) == 0U)
      {
        if (free_blocks == 0U)
        {
          first_free_block_col = j;
          first_free_block_line = i;
          free_blocks++;
        }
        j++;

        /* Parse Column PMALockTable */
        while ((j <= 31U) && ((entry & ((uint32_t)1U << j)) == 0U) && (free_blocks < nbr_req_blocks))
        {
          free_blocks++;
          j++;
        }

        /* Free contiguous Blocks not found */
        if (((free_blocks < nbr_req_blocks) && (j < 31U)) || ((j == 31U) && ((entry & ((uint32_t)1U << j)) != 0U)))
        {
          free_blocks = 0U;
        }
      }
      j++;
    } /* End for j */
  } /* End for i */

  /* Free block found */
  if (free_blocks >= nbr_req_blocks)
  {
    col_idx = first_free_block_col;

    for (uint8_t i = first_free_block_line; ((i < PMA_BLOCKS) && (free_blocks > 0U)); i++)
    {
      for (uint8_t j = col_idx; j <= 31U; j++)
      {
        PMALookupTable[i] |= ((uint32_t)1U << j);

        if (--free_blocks == 0U)
        {
          break;
        }
      }
      col_idx = 0U;
    }

    return (uint16_t)((first_free_block_line * (uint16_t)256U) + (first_free_block_col * (uint16_t)8U));
  }
  else
  {
    return 0xFFFFU;
  }
}

/**
  * @brief  PMA Free
  * @param  pma_base PMA base offset
  * @param  mps  Max Packet Size
  * @retval status
  */
static usb_core_status_t USB_DRD_PMAFree(uint32_t pma_base, uint16_t mps)
{
  uint32_t block_nbr;
  uint8_t col_idx;
  uint8_t line_idx;
  uint16_t mps_t = mps;

  /* Since PMA buffer descriptor RXBD allocate address according to BLSIZE, BLSIZE=1==> mps>64
    allocation in PMA is done in 32Bytes each entry */
  if ((mps_t > 64U) && ((mps_t % 32U) != 0U))
  {
    /* Align the mps to 32byte block to match the allocation in PMA,
      check Definition of allocation buffer memory in usb user spec */
    mps_t = (uint16_t)(((mps_t / 32U) + 1U) * 32U);
  }

  /* Calculate the number of needed block to Free */
  if ((mps_t / 8U) != 0U)
  {
    block_nbr = ((uint32_t)mps_t / 8U);

    if ((mps_t % 8U) != 0U)
    {
      block_nbr++;
    }
  }
  else
  {
    block_nbr = 1U;
  }

  /* Decode Col/Line of PMA_Base position in the PMA_LookupTable */
  if (pma_base > 256U)
  {
    line_idx = (uint8_t)(pma_base / 256U);
    col_idx = (uint8_t)((pma_base - ((uint32_t)line_idx * 256U)) / 8U);
  }
  else
  {
    line_idx = 0U;
    col_idx = (uint8_t)(pma_base / 8U);
  }

  /* Reset the corresponding bit in the lookupTable */
  for (uint8_t i = line_idx; ((i < PMA_BLOCKS) && (block_nbr > 0U)); i++)
  {
    for (uint8_t j = col_idx; j <= 31U; j++)
    {
      /* Check if the block is not already reserved or it was already closed */
      if ((PMALookupTable[i] & ((uint32_t)1UL << j)) == 0U)
      {
        return USB_CORE_ERROR;
      }
      /* Free the reserved block by resetting the corresponding bit */
      PMALookupTable[i] &= ~(1UL << j);

      if (--block_nbr == 0U)
      {
        break;
      }
    }
    col_idx = 0U;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Allocate PMA buffer for Channel
  *         This API will fetch a free space
  * @param  p_ch pointer to channel
  * @param  ch_kind endpoint Kind
  *                  USB_SNG_BUF Single Buffer used
  *                  USB_DBL_BUF Double Buffer used
  * @retval status
  */
static usb_core_status_t USB_DRD_PMAlloc(usb_core_ch_t *p_ch, uint16_t ch_kind)
{
  uint16_t pma_addr0;
  uint16_t pma_addr1; /* Used for double buffer mode if enabled */

  /* Get a FreePMA Address */
  pma_addr0 = USB_DRD_GetFreePMA(p_ch->max_packet);

  /* Check allocated pma address */
  if (pma_addr0 == 0xFFFFU)
  {
    return USB_CORE_ERROR;
  }
  else
  {
    /* Check if the endpoint is single or double Buffer */
    if (ch_kind == (uint16_t)USB_DRD_SNG_BUF)
    {
      /* Single Buffer */
      p_ch->double_buffer_en = (uint8_t)USB_CORE_CONFIG_DISABLED;

      if (p_ch->ep_num == USB_CORE_ENDPOINT_0)
      {
        chep0.virtual_ch_num = p_ch->ch_num;
        chep0.is_allocated = 1U;
        p_ch->max_packet = 64U;
      }

      /* Configure the PMA */
      if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
      {
        p_ch->pma_addr1 = pma_addr0;
        (USB_DRD_PMA_BUFF + (uint32_t)p_ch->phy_ch_num)->RXBD = p_ch->pma_addr1;

        if (p_ch->ep_num == USB_CORE_ENDPOINT_0)
        {
          chep0.dir = USB_CORE_EP_IN_DIR;
          chep0.pma_addr1 = p_ch->pma_addr1;
        }
      }
      else
      {
        p_ch->pma_addr0 = pma_addr0;
        (USB_DRD_PMA_BUFF + (uint32_t)p_ch->phy_ch_num)->TXBD = p_ch->pma_addr0;

        if (p_ch->ep_num == USB_CORE_ENDPOINT_0)
        {
          chep0.pma_addr0 = p_ch->pma_addr0;
        }
      }

      /* Set the PmaAddress */
      p_ch->pma_address = pma_addr0;
    }
    else /* USB_DBL_BUF */
    {
      /* Double Buffer Endpoint */
      p_ch->double_buffer_en = (uint8_t)USB_CORE_CONFIG_ENABLED;

      /* Get a FreePMA Address for buffer 2 */
      pma_addr1 = USB_DRD_GetFreePMA(p_ch->max_packet);

      if (pma_addr1 == 0xFFFFU)
      {
        /* Free the first buffer */
        (void)USB_DRD_PMAFree(pma_addr0, p_ch->max_packet);
        return USB_CORE_ERROR;
      }
      else
      {
        /* Configure the PMA */
        p_ch->pma_addr0 = (uint16_t)(pma_addr0);
        p_ch->pma_addr1 = (uint16_t)(pma_addr1);

        /* Set Buffer0 pma address */
        (USB_DRD_PMA_BUFF + (uint32_t)p_ch->phy_ch_num)->TXBD = pma_addr0;

        /* Set Buffer1 pma address */
        (USB_DRD_PMA_BUFF + (uint32_t)p_ch->phy_ch_num)->RXBD = pma_addr1;

        /* Used for Bulk DB MPS < 64bytes */
        if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
        {
          p_ch->pma_address = p_ch->pma_addr1;
        }
        else
        {
          p_ch->pma_address = p_ch->pma_addr0;
        }
      }
    }
  }

  return USB_CORE_OK;
}

/**
  * @brief  PMA De-Allocation for Channel Free the reserved block in the PMA-LookupTable
  * @param  p_ch pointer to Host Channel
  * @retval status
  */
static usb_core_status_t USB_DRD_PMADeAlloc(usb_core_ch_t *p_ch)
{
  usb_core_status_t status;
  uint8_t error = 0U;

