STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
  /* Single Buffer */
  if (p_ch->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
  {
    status = USB_DRD_PMAFree(p_ch->pma_address, p_ch->max_packet);
  }
  else   /* Double buffer */
  {
    status = USB_DRD_PMAFree(p_ch->pma_addr0, p_ch->max_packet);
    if (status != USB_CORE_OK)
    {
      error++;
    }

    status = USB_DRD_PMAFree(p_ch->pma_addr1, p_ch->max_packet);
    if (status != USB_CORE_OK)
    {
      error++;
    }

    if (error != 0U)
    {
      return USB_CORE_ERROR;
    }
  }

  return status;
}
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup USB_DRD_CORE_Exported_Functions USB Core Low Layer Exported Functions
  * @{
  */

/**
  * @brief  Initializes the USB Core
  * @param  instance USB Instance
  * @param  p_core_config USB Instance configuration parameters
  *         for the specified USB peripheral.
  * @retval HAL status
  */
usb_core_status_t USB_DRD_InitCore(uint32_t instance, const usb_core_config_params_t *p_core_config)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  usb_core_status_t ret;
  STM32_UNUSED(p_core_config);

  /* Reset after a PHY select */
  ret = USB_DRD_ResetCore(instance);

  /* Clear pending interrupts */
  p_usb->ISTR = 0U;

  return ret;
}

/**
  * @brief  Initializes the USB Core
  * @param  instance USB Instance
  * @retval HAL status
  */
usb_core_status_t USB_DRD_DeInitCore(uint32_t instance)
{
  STM32_UNUSED(instance);
  uint8_t idx;

  /* Reset PMA Address */
  (void)USB_DRD_PMAReset();

  for (idx = 0U; idx < USB_DRD_MAX_CHEP_NBR; idx++)
  {
    phy_chin_state[idx] = 0U;
    phy_chout_state[idx] = 0U;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Enable Global Interrupt
  *         Enables the controller's Global Int in the AHB Config reg
  * @param  instance Selected device
  * @retval HAL status
  */
usb_core_status_t USB_DRD_EnableGlobalInterrupt(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t winterruptmask;

  /* Clear pending interrupts */
  p_usb->ISTR = 0U;

  /* Set winterruptmask variable */
  winterruptmask = USB_CNTR_CTRM  | USB_CNTR_WKUPM |
                   USB_CNTR_SUSPM | USB_CNTR_ERRM |
                   USB_CNTR_SOFM | USB_CNTR_ESOFM |
                   USB_CNTR_RESETM | USB_CNTR_L1REQM;

  /* Set interrupt mask */
  p_usb->CNTR = winterruptmask;

  return USB_CORE_OK;
}

/**
  * @brief  Disable Global Interrupt
  *         Disable the controller's Global Int in the AHB Config reg
  * @param  instance Selected device
  * @retval HAL status
  */
usb_core_status_t USB_DRD_DisableGlobalInterrupt(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t winterruptmask;

  /* Set winterruptmask variable */
  winterruptmask = USB_CNTR_CTRM  | USB_CNTR_WKUPM |
                   USB_CNTR_SUSPM | USB_CNTR_ERRM |
                   USB_CNTR_SOFM | USB_CNTR_ESOFM |
                   USB_CNTR_RESETM | USB_CNTR_L1REQM;

  /* Clear interrupt mask */
  p_usb->CNTR &= ~winterruptmask;

  return USB_CORE_OK;
}

/**
  * @brief  Set current functional mode
  * @param  instance Selected device
  * @param  core_mode current core mode
  *          This parameter can be one of the these values:
  *            @arg USB_CORE_XXX_MODE Peripheral mode
  * @retval HAL status
  */
usb_core_status_t USB_DRD_SetCurrentMode(uint32_t instance, usb_core_mode_t core_mode)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  if (core_mode == USB_CORE_DEVICE_MODE)
  {
    p_usb->CNTR &= ~USB_CNTR_HOST;
  }
  else if (core_mode == USB_CORE_HOST_MODE)
  {
    p_usb->CNTR |= USB_CNTR_HOST;
  }
  else
  {
    return USB_CORE_ERROR;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Returns USB core mode
  * @param  instance  Selected device
  * @retval return core mode : Host or Device
  *          This parameter can be one of these values:
  *           0 : USB_CORE_DEVICE_MODE
  *           1 : USB_CORE_HOST_MODE
  */
usb_core_mode_t USB_DRD_GetCurrentMode(uint32_t instance)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t current_mode = (p_usb->CNTR & USB_CNTR_HOST) >> 31U;

  return (usb_core_mode_t)current_mode;
}

/**
  * @brief  USB_DRD_ReadInterrupts return the global USB interrupt status
  * @param  instance Selected device
  * @retval USB Global Interrupt status
  */
uint32_t USB_DRD_ReadInterrupts(uint32_t instance)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  uint32_t istr_reg;

  istr_reg = p_usb->ISTR;
  return istr_reg;
}

/**
  * @brief  USB_DRD_ClearInterrupts clear USB interrupt flags
  * @param  instance Selected device
  * @param  interrupt Interrupt flag
  */
void USB_DRD_ClearInterrupts(uint32_t instance, uint32_t interrupt)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  p_usb->ISTR &= (uint16_t)(~interrupt);
}

/**
  * @brief  Copy a buffer from user memory area to packet memory area (PMA)
  * @param  instance USB peripheral instance register address
  * @param  p_src pointer to user memory area
  * @param  pma_address pma buffer address
  * @param  size_byte number of bytes to be copied to packet memory area
  */
void USB_DRD_WritePMA(uint32_t instance, uint8_t *p_src, uint16_t pma_address, uint16_t size_byte)
{
  STM32_UNUSED(instance);
  __IO uint32_t *p_pma_buffer_addr;
  uint32_t remaining_data;
  uint32_t count;
  uint32_t count32b = ((uint32_t)size_byte + 3U) >> 2U;
  /* Due to the PMA access 32bit only so the last non word data to be processed alone */
  uint16_t remaining_bytes = size_byte % 4U;
  uint8_t *p_src_buffer = p_src;

  /* Check if there is a remaining byte */
  if (remaining_bytes != 0U)
  {
    count32b--;
  }

  /* Get the PMA Buffer pointer */
  p_pma_buffer_addr = (__IO uint32_t *)(USB_DRD_PMAADDR + (uint32_t)pma_address);

  /* Write the Calculated Word into the PMA related Buffer */
  for (count = count32b; count != 0U; count--)
  {
    *p_pma_buffer_addr = __UNALIGNED_UINT32_READ(p_src_buffer);
    p_pma_buffer_addr++;
    /* Increment p_src_buffer 4 Time as Word Increment */
    p_src_buffer++;
    p_src_buffer++;
    p_src_buffer++;
    p_src_buffer++;
  }

  /* When Number of data is not word aligned, write the remaining Byte */
  if (remaining_bytes != 0U)
  {
    remaining_data = 0U;

    do
    {
      remaining_data |= (uint32_t)(*(uint8_t *)p_src_buffer) << (8U * count);
      count++;
      p_src_buffer++;
      remaining_bytes--;
    } while (remaining_bytes != 0U);

    *p_pma_buffer_addr = remaining_data;
  }
}

/**
  * @brief Copy data from packet memory area (PMA) to user memory buffer
  * @param   instance USB peripheral instance register address.
  * @param   p_dest pointer to user memory area
  * @param   pma_address address into PMA
  * @param   size_byte number of bytes to be copied to user memory buffer
  */
void USB_DRD_ReadPMA(uint32_t instance, uint8_t *p_dest, uint16_t pma_address, uint16_t size_byte)
{
  STM32_UNUSED(instance);
  __IO uint32_t *p_pma_buffer_addr;
  uint32_t count;
  uint32_t remaining_data;
  uint32_t count32b = ((uint32_t)size_byte + 3U) >> 2U;

  /* Due to the PMA access 32bit only so the last non word data to be processed alone */
  uint16_t remaining_bytes = size_byte % 4U;
  uint8_t *p_dest_Buffer = p_dest;

  /* Get the PMA Buffer pointer */
  p_pma_buffer_addr = (__IO uint32_t *)(USB_DRD_PMAADDR + (uint32_t)pma_address);

  /* If number of byte is not word aligned decrement the number of word */
  if (remaining_bytes != 0U)
  {
    count32b--;
  }

  /* Read data packet From the PMA Buffer */
  for (count = count32b; count != 0U; count--)
  {
    __UNALIGNED_UINT32_WRITE(p_dest_Buffer, *p_pma_buffer_addr);

    p_pma_buffer_addr++;
    p_dest_Buffer++;
    p_dest_Buffer++;
    p_dest_Buffer++;
    p_dest_Buffer++;
  }

