STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
  /* When Number of data is not word aligned, read the remaining byte */
  if (remaining_bytes != 0U)
  {
    remaining_data = *(__IO uint32_t *)p_pma_buffer_addr;

    do
    {
      *(uint8_t *)p_dest_Buffer = (uint8_t)(remaining_data >> (8U * (uint8_t)(count)));
      count++;
      p_dest_Buffer++;
      remaining_bytes--;
    } while (remaining_bytes != 0U);
  }
}

/*----------------------  PMA Allocation Section --------------------- */
/*
                __col31________________col0__   Column-- >
          lin0 | entry31.|.......  | entry0 |   Line
               |---------|---------|--------|    |
          line1| entry63.|.......  | entry32|    |
               |---------|---------|--------|   \|/
               | entry127|.......  | entry64|
               |---------|---------|--------|
               | entry256|......   |entry128|
                ----------------------------
           an allocation space of 64byte need 8 Free contiguous entry in the Matrix
           - a Free entry is a bit with 0 Value/  a busy entry is a bit with 1 value. */


/**
  * @brief  PMA Reset
  * @retval status
  */
usb_core_status_t USB_DRD_PMAReset(void)
{
  uint16_t index;

  /* Reset All PMA entry */
  for (index = 0U; index < PMA_BLOCKS; index++)
  {
    PMALookupTable[index] = 0U;
  }

  /* Allocate a Space for buffer descriptor table depending on the Host channel number */
  for (index = 0U; index < USB_DRD_MAX_CHEP_NBR; index++)
  {
    PMALookupTable[0] |= ((uint32_t)1UL << index);
  }

  /* Reset Ep0 Pma allocation state */
  chep0.virtual_ch_num = USB_CORE_CHANNEL_FF;
  chep0.dir = USB_CORE_EP_OUT_DIR;
  chep0.is_allocated = 0U;
  chep0.is_dual_allocated = 0U;
  chep0.pma_addr0 = 0U;
  chep0.pma_addr1 = 0U;

  return USB_CORE_OK;
}
/**
  * @}
  */

/** @defgroup USB_DRD_CORE_Device_Exported_Functions USB Core Device Low Layer Exported Functions
  * @{
  */

/**
  * @brief  Initialize the USB DRD PCD Driver
  * @param  p_driver pointer to USB PCD driver structure
  * @retval HAL status
  */
usb_core_status_t USB_DRD_PCD_InitDriver(usb_core_pcd_driver_t *p_driver)
{
  p_driver->core_init = USB_DRD_InitCore;
  p_driver->core_set_mode = USB_DRD_SetCurrentMode;
  p_driver->core_get_mode = USB_DRD_GetCurrentMode;
  p_driver->core_enable_interrupts = USB_DRD_EnableGlobalInterrupt;
  p_driver->core_disable_interrupts = USB_DRD_DisableGlobalInterrupt;
  p_driver->device_init = USB_DRD_InitDevice;
  p_driver->device_start = USB_DRD_StartDevice;
  p_driver->device_stop = USB_DRD_StopDevice;
  p_driver->device_connect = USB_DRD_ConnectDevice;
  p_driver->device_disconnect = USB_DRD_DisconnectDevice;
  p_driver->device_set_address = USB_DRD_SetDeviceAddress;
  p_driver->device_get_speed = USB_DRD_GetDeviceSpeed;
  p_driver->ep_activate = USB_DRD_ActivateEndpoint;
  p_driver->ep_deactivate = USB_DRD_DeactivateEndpoint;
  p_driver->ep_start_transfer = USB_DRD_StartEndpointXfer;
  p_driver->ep_stop_transfer = USB_DRD_StopEndpointXfer;
  p_driver->ep_set_stall = USB_DRD_SetEndpointStall;
  p_driver->ep_clear_stall = USB_DRD_ClearEndpointStall;
  p_driver->remote_wakeup_activate = USB_DRD_ActivateRemoteWakeup;
  p_driver->remote_wakeup_deactivate = USB_DRD_DeActivateRemoteWakeup;

  p_driver->lpm_activate = USB_DRD_LPM_Activate;
  p_driver->lpm_deactivate = USB_DRD_LPM_DeActivate;

  p_driver->bcd_activate = USB_DRD_BCD_Activate;
  p_driver->bcd_deactivate = USB_DRD_BCD_DeActivate;
  p_driver->bcd_set_mode = USB_DRD_BCD_SetMode;
  p_driver->bcd_detect_port_type = USB_DRD_BCD_SetPortDetection;

  return USB_CORE_OK;
}

/**
  * @brief  Set BCD mode.
  * @param  instance Selected device
  * @param  bcd_config
  * @param  bcd_sts
  */
usb_core_status_t  USB_DRD_BCD_SetMode(uint32_t instance,
                                       usb_core_bcd_config_t bcd_config, usb_core_bcd_config_sts_t bcd_sts)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  switch (bcd_config)
  {
    case USB_CORE_BCD_CONFIG_DCD:
      if (bcd_sts == USB_CORE_BCD_CONFIG_STS_SET)
      {
        p_usb->BCDR |= USB_BCDR_DCDEN;
      }
      else
      {
        p_usb->BCDR &= ~USB_BCDR_DCDEN;
      }
      break;

    case USB_CORE_BCD_CONFIG_PD:
      if (bcd_sts == USB_CORE_BCD_CONFIG_STS_SET)
      {
        p_usb->BCDR |= USB_BCDR_PDEN;
      }
      else
      {
        p_usb->BCDR &= ~USB_BCDR_PDEN;
      }
      break;

    case USB_CORE_BCD_CONFIG_SD:
      if (bcd_sts == USB_CORE_BCD_CONFIG_STS_SET)
      {
        p_usb->BCDR |= USB_BCDR_SDEN;
      }
      else
      {
        p_usb->BCDR &= ~USB_BCDR_SDEN;
      }
      break;

    default:
      return USB_CORE_ERROR;
      break;
  }

  return USB_CORE_OK;
}


/**
  * @brief  Port Detection Process.
  * @param  instance Selected device
  * @param  detection Primary and Secondary detection
  * @retval port detection status
  */
usb_core_bcd_port_status_t USB_DRD_BCD_SetPortDetection(uint32_t instance, usb_core_bcd_detection_t detection)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  usb_core_bcd_port_status_t port_detection_status = USB_CORE_BCD_PORT_STATUS_DEFAULT;

  if (detection == USB_CORE_BCD_PRIMARY_DETECTION)
  {
    /* If Charger detect ? */
    if ((p_usb->BCDR & USB_BCDR_PDET) == USB_BCDR_PDET)
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_NOT_STD_DOWNSTREAM;
    }
    else
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_STD_DOWNSTREAM;
    }
  }
  else if (detection == USB_CORE_BCD_SECONDARY_DETECTION)
  {
    /* If CDP ? */
    if ((p_usb->BCDR & USB_BCDR_SDET) == USB_BCDR_SDET)
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_DEDICATED_CHARGING;
    }
    else
    {
      port_detection_status = USB_CORE_BCD_PORT_STATUS_CHARGING_DOWNSTREAM;
    }
  }
  else
  {
    /* ... */
  }

  return port_detection_status;
}

/**
  * @brief  Activate BatteryCharging feature.
  * @param  instance Selected instance
  * @retval HAL status
  */
usb_core_status_t USB_DRD_BCD_Activate(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Enable BCD feature */
  p_usb->BCDR |= USB_BCDR_BCDEN;

  /* Enable DCD : Data Contact Detect */
  p_usb->BCDR &= ~(USB_BCDR_PDEN);
  p_usb->BCDR &= ~(USB_BCDR_SDEN);
  p_usb->BCDR |= USB_BCDR_DCDEN;

  return USB_CORE_OK;
}

/**
  * @brief  Deactivate BatteryCharging feature.
  * @param  instance Selected instance
  * @retval HAL status
  */
usb_core_status_t USB_DRD_BCD_DeActivate(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Disable BCD feature */
  p_usb->BCDR &= ~(USB_BCDR_BCDEN);

  return USB_CORE_OK;
}


/**
  * @brief  Activate LPM feature.
  * @param  instance Selected instance
  * @retval HAL status
  */
usb_core_status_t USB_DRD_LPM_Activate(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  p_usb->LPMCSR |= USB_LPMCSR_LMPEN;
  p_usb->LPMCSR |= USB_LPMCSR_LPMACK;

  return USB_CORE_OK;
}

/**
  * @brief  USB_DRD_LPM_DeActivate Deactivate LPM feature.
  * @param  instance Selected instance
  * @retval HAL status
  */
usb_core_status_t USB_DRD_LPM_DeActivate(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

