STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
  p_usb->LPMCSR &= ~(USB_LPMCSR_LMPEN);
  p_usb->LPMCSR &= ~(USB_LPMCSR_LPMACK);

  return USB_CORE_OK;
}

/**
  * @brief  USB_DRD_ActivateRemoteWakeup active remote wakeup signalling
  * @param  instance Selected device
  * @retval HAL status
  */
usb_core_status_t USB_DRD_ActivateRemoteWakeup(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  p_usb->CNTR |= USB_CNTR_L2RES;

  return USB_CORE_OK;
}

/**
  * @brief  USB_DRD_DeActivateRemoteWakeup de-active remote wakeup signalling
  * @param  instance Selected device
  * @retval HAL status
  */
usb_core_status_t USB_DRD_DeActivateRemoteWakeup(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  p_usb->CNTR &= ~USB_CNTR_L2RES;

  return USB_CORE_OK;
}

/**
  * @brief  Initializes the USB controller registers
  *         for device mode
  * @param  instance Selected device
  * @param  p_core_config USB Instance configuration parameters
  *         for the specified USB peripheral.
  * @retval HAL status
  */
usb_core_status_t USB_DRD_InitDevice(uint32_t instance, const usb_core_config_params_t *p_core_config)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  usb_core_status_t ret;

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(p_core_config);

  /* Force Reset */
  p_usb->CNTR = USB_CNTR_USBRST;

  /* Release Reset */
  p_usb->CNTR &= ~USB_CNTR_USBRST;

  /* Set the Device Mode */
  ret = USB_DRD_SetCurrentMode(instance, USB_CORE_DEVICE_MODE);

  /* Clear pending interrupts */
  p_usb->ISTR = 0U;

  return ret;
}

/**
  * @brief  Start the USB device
  * @param  instance selected device
  * @retval status
  */
usb_core_status_t USB_DRD_StartDevice(uint32_t instance)
{
  (void)USB_DRD_EnableGlobalInterrupt(instance);
  (void)USB_DRD_ConnectDevice(instance);

  return USB_CORE_OK;
}

/**
  * @brief  Stop the usb device mode
  * @param  instance Selected device
  * @retval HAL status
  */
usb_core_status_t USB_DRD_StopDevice(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Disable all interrupts and force USB reset */
  p_usb->CNTR = USB_CNTR_USBRST;

  /* Clear interrupt status register */
  p_usb->ISTR = 0U;

  /* Switch-off device */
  p_usb->CNTR = (USB_CNTR_USBRST | USB_CNTR_PDWN);

  return USB_CORE_OK;
}

/**
  * @brief  Set usb device address
  * @param  instance Selected device
  * @param  address new device address to be assigned
  *         This parameter can be a value from 0 to 255
  * @retval HAL status
  */
usb_core_status_t USB_DRD_SetDeviceAddress(uint32_t instance, uint8_t address)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  if (address == 0U)
  {
    /* Set device address and enable function */
    p_usb->DADDR = USB_DADDR_EF;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Return the Device Speed
  * @param  instance  Selected device
  * @retval device_speed  device speed
  *          @arg USB_CORE_DEVICE_SPEED_FS: Full speed mode
  */
usb_core_device_speed_t USB_DRD_GetDeviceSpeed(uint32_t instance)
{
  STM32_UNUSED(instance);

  usb_core_device_speed_t device_speed = USB_CORE_DEVICE_SPEED_FS;

  return device_speed;
}

/**
  * @brief  Connect the USB device by enabling the pull-up/pull-down
  * @param  instance Selected device
  * @retval HAL status
  */
usb_core_status_t USB_DRD_ConnectDevice(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Enabling DP Pull-UP bit to Connect internal PU resistor on USB DP line */
  p_usb->BCDR |= USB_BCDR_DPPU;

  return USB_CORE_OK;
}

/**
  * @brief  Disconnect the USB device by disabling the pull-up/pull-down
  * @param  instance Selected device
  * @retval HAL status
  */
usb_core_status_t USB_DRD_DisconnectDevice(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Disable DP Pull-Up bit to disconnect the Internal PU resistor on USB DP line */
  p_usb->BCDR &= ~(USB_BCDR_DPPU);

  return USB_CORE_OK;
}

/**
  * @brief  Activate and configure an endpoint
  * @param  instance Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval HAL status
  */
usb_core_status_t USB_DRD_ActivateEndpoint(uint32_t instance, usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;
  uint32_t ep_value;

  /* Get Endpoint Physical number */
  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  ep_value = PCD_GET_ENDPOINT(instance, phy_ep_num) & USB_EP_T_MASK;

  /* Initialize Endpoint */
  if (p_ep->type == USB_CORE_EP_TYPE_CTRL)
  {
    ep_value |= USB_EP_CONTROL;
  }
  else if (p_ep->type == USB_CORE_EP_TYPE_BULK)
  {
    ep_value |= USB_EP_BULK;
  }
  else if (p_ep->type == USB_CORE_EP_TYPE_INTR)
  {
    ep_value |= USB_EP_INTERRUPT;
  }
  else
  {
    ep_value |= USB_EP_ISOCHRONOUS;
  }

  PCD_SET_ENDPOINT(instance, phy_ep_num, (ep_value | USB_EP_VTRX | USB_EP_VTTX));

  PCD_SET_EP_ADDRESS(instance, phy_ep_num, (uint8_t)p_ep->num);

  if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
  {
    if (p_ep->dir == USB_CORE_EP_IN_DIR)
    {
      /* Set the endpoint Transmit buffer address */
      PCD_SET_EP_TX_ADDRESS(instance, phy_ep_num, p_ep->pma_address);
      PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

      if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
      {
        /* Configure NAK status for all non ISOC Endpoint */
        PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_NAK);
      }
      else
      {
        /* Configure TX for ISOC Endpoint to disabled state */
        PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
      }
    }
    else
    {
      /* Set the endpoint Receive buffer address */
      PCD_SET_EP_RX_ADDRESS(instance, phy_ep_num, p_ep->pma_address);

      /* Set the endpoint Receive buffer counter */
      PCD_SET_EP_RX_CNT(instance, phy_ep_num, p_ep->max_packet);
      PCD_CLEAR_RX_DTOG(instance, phy_ep_num);

      if (phy_ep_num == USB_CORE_PHY_CHEP_0)
      {
        /* Configure VALID status for EP0 */
        PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_VALID);
      }
      else
      {
        /* Configure NAK status for OUT Endpoint */
        PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_NAK);
      }
    }
  }
  /* Double Buffer */
  else
  {
    if (p_ep->type == USB_CORE_EP_TYPE_BULK)
    {
      /* Set bulk endpoint as double buffered */
      PCD_SET_BULK_EP_DBUF(instance, phy_ep_num);
    }
    else
    {
      /* Set the ISOC endpoint in double buffer mode */
      PCD_CLEAR_EP_KIND(instance, phy_ep_num);
    }

