STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
    /* Set buffer address for double buffered mode */
    PCD_SET_EP_DBUF_ADDR(instance, phy_ep_num, p_ep->pma_addr0, p_ep->pma_addr1);

    if (p_ep->dir == USB_CORE_EP_OUT_DIR)
    {
      /* Clear the data toggle bits for the endpoint IN/OUT */
      PCD_CLEAR_RX_DTOG(instance, phy_ep_num);
      PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

      /* Set endpoint RX count */
      PCD_SET_EP_DBUF_CNT(instance, phy_ep_num, p_ep->dir, p_ep->max_packet);

      /* Set endpoint RX to valid state */
      PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_VALID);
      PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
    }
    else
    {
      /* Clear the data toggle bits for the endpoint IN/OUT */
      PCD_CLEAR_RX_DTOG(instance, phy_ep_num);
      PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

      if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
      {
        /* Configure NAK status for all non ISOC Endpoint */
        PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_NAK);
      }
      else
      {
        /* Configure TX for ISOC Endpoint to disabled state */
        PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
      }

      PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
    }
  }

  return USB_CORE_OK;
}

/**
  * @brief  De-activate and de-initialize an endpoint
  * @param  instance Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval HAL status
  */
usb_core_status_t USB_DRD_DeactivateEndpoint(uint32_t instance, const usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;

  if ((uint8_t)p_ep->num > USB_DRD_MAX_CHEP_NBR)
  {
    return USB_CORE_ERROR;
  }

  /* Get Endpoint Physical number */
  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
  {
    if (p_ep->dir == USB_CORE_EP_IN_DIR)
    {
      PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

      /* Configure DISABLE status for the Endpoint */
      PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
    }

    else
    {
      PCD_CLEAR_RX_DTOG(instance, phy_ep_num);

      /* Configure DISABLE status for the Endpoint */
      PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
    }
  }
  /* Double Buffer */
  else
  {
    if (p_ep->dir == USB_CORE_EP_OUT_DIR)
    {
      /* Clear the data toggle bits for the endpoint IN/OUT */
      PCD_CLEAR_RX_DTOG(instance, phy_ep_num);
      PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

      /* Reset value of the data toggle bits for the endpoint OUT */
      PCD_TX_DTOG(instance, phy_ep_num);

      PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
      PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
    }
    else
    {
      /* Clear the data toggle bits for the endpoint IN/OUT */
      PCD_CLEAR_RX_DTOG(instance, phy_ep_num);
      PCD_CLEAR_TX_DTOG(instance, phy_ep_num);
      PCD_RX_DTOG(instance, phy_ep_num);

      /* Configure DISABLE status for the Endpoint */
      PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
      PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
    }
  }

  return USB_CORE_OK;
}

/**
  * @brief  Setup and starts a transfer over an EP
  * @param  instance Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval HAL status
  */
usb_core_status_t USB_DRD_StartEndpointXfer(uint32_t instance, usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;
  uint32_t length;
  uint16_t pma_buffer;
  uint16_t ep_value;

  /* Get Endpoint Physical number */
  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  /* IN endpoint */
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    /* Multi packet transfer */
    if (p_ep->xfer_length > p_ep->max_packet)
    {
      length = p_ep->max_packet;
    }
    else
    {
      length = p_ep->xfer_length;
    }

    /* Configure and validate Tx endpoint */
    if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, p_ep->pma_address, (uint16_t)length);
      PCD_SET_EP_TX_CNT(instance, phy_ep_num, length);
    }
    else
    {
      /* Double buffer bulk management */
      if (p_ep->type == USB_CORE_EP_TYPE_BULK)
      {
        p_ep->xfer_fill_db = 1U;

        if (p_ep->xfer_size > p_ep->max_packet)
        {
          /* Enable double buffer */
          PCD_SET_BULK_EP_DBUF(instance, phy_ep_num);

          /* Each Time to write in PMA xfer_len_db will */
          p_ep->xfer_size -= length;

          /* Fill the two first buffer in the Buffer0 & Buffer1 */
          if ((PCD_GET_ENDPOINT(instance, phy_ep_num) & USB_EP_DTOG_TX) != 0U)
          {
            /* Set the Double buffer counter for pmabuffer1 */
            PCD_SET_EP_DBUF1_CNT(instance, phy_ep_num, p_ep->dir, length);
            pma_buffer = p_ep->pma_addr1;

            /* Write the user buffer to USB PMA */
            USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
            p_ep->p_xfer_buffer += length;

            if (p_ep->xfer_size > p_ep->max_packet)
            {
              p_ep->xfer_size -= length;
            }
            else
            {
              length = p_ep->xfer_size;
              p_ep->xfer_size = 0U;
            }

            /* Set the Double buffer counter for pmabuffer0 */
            PCD_SET_EP_DBUF0_CNT(instance, phy_ep_num, p_ep->dir, length);
            pma_buffer = p_ep->pma_addr0;

            /* Write the user buffer to USB PMA */
            USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
          }
          else
          {
            /* Set the Double buffer counter for pmabuffer0 */
            PCD_SET_EP_DBUF0_CNT(instance, phy_ep_num, p_ep->dir, length);
            pma_buffer = p_ep->pma_addr0;

            /* Write the user buffer to USB PMA */
            USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
            p_ep->p_xfer_buffer += length;

            if (p_ep->xfer_size > p_ep->max_packet)
            {
              p_ep->xfer_size -= length;
            }
            else
            {
              length = p_ep->xfer_size;
              p_ep->xfer_size = 0U;
            }

            /* Set the Double buffer counter for pmabuffer1 */
            PCD_SET_EP_DBUF1_CNT(instance, phy_ep_num, p_ep->dir, length);
            pma_buffer = p_ep->pma_addr1;

            /* Write the user buffer to USB PMA */
            USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
          }
        }
        /* Auto Switch to single buffer mode when transfer <Mps no need to manage in double buffer */
        else
        {
          length = p_ep->xfer_size;

          /* Disable double buffer mode for Bulk endpoint */
          PCD_CLEAR_BULK_EP_DBUF(instance, phy_ep_num);

          /* Set Tx count with nbre of byte to be transmitted */
          PCD_SET_EP_TX_CNT(instance, phy_ep_num, length);
          pma_buffer = p_ep->pma_addr0;

          /* Write the user buffer to USB PMA */
          USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
        }
      }
      else /* Manage isochronous double buffer IN mode */
      {
        /* Each Time to write in PMA xfer_len_db will */
        p_ep->xfer_size -= length;

        /* Fill the data buffer */
        if ((PCD_GET_ENDPOINT(instance, phy_ep_num) & USB_EP_DTOG_TX) != 0U)
        {
          /* Set the Double buffer counter for pmabuffer1 */
          PCD_SET_EP_DBUF1_CNT(instance, phy_ep_num, p_ep->dir, length);
          pma_buffer = p_ep->pma_addr1;

          /* Write the user buffer to USB PMA */
          USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
        }
        else
        {
          /* Set the Double buffer counter for pmabuffer0 */
          PCD_SET_EP_DBUF0_CNT(instance, phy_ep_num, p_ep->dir, length);
          pma_buffer = p_ep->pma_addr0;

          /* Write the user buffer to USB PMA */
          USB_DRD_WritePMA(instance, p_ep->p_xfer_buffer, pma_buffer, (uint16_t)length);
        }
      }
    }

    PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_VALID);
  }
  else /* OUT endpoint */
  {
    if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      if ((p_ep->xfer_length == 0U) && (p_ep->type == USB_CORE_EP_TYPE_CTRL))
      {
        /* This is a status out stage set the OUT_STATUS */
        PCD_SET_OUT_STATUS(instance, phy_ep_num);
      }
      else
      {
        PCD_CLEAR_OUT_STATUS(instance, phy_ep_num);
      }

      /* Multi packet transfer */
      if (p_ep->xfer_length > p_ep->max_packet)
      {
        p_ep->xfer_length -= p_ep->max_packet;
      }
      else
      {
        p_ep->xfer_length = 0U;
      }
    }
    else
    {
      /* First Transfer Coming From HAL_PCD_EP_Receive & From ISR */
      /* Set the Double buffer counter */
      if (p_ep->type == USB_CORE_EP_TYPE_BULK)
      {
        /* Coming from ISR */
        if (p_ep->xfer_count != 0U)
        {
          /* Update last value to check if there is blocking state */
          ep_value = (uint16_t)PCD_GET_ENDPOINT(instance, phy_ep_num);

          /* Blocking State */
          if ((((ep_value & USB_EP_DTOG_RX) != 0U) && ((ep_value & USB_EP_DTOG_TX) != 0U))
              || (((ep_value & USB_EP_DTOG_RX) == 0U) && ((ep_value & USB_EP_DTOG_TX) == 0U)))
          {
            /* OUT double buffered endpoint */
            USB_DRD_TX_DTOG(instance, phy_ep_num);
          }
        }
      }
      /* ISO OUT double buffer */
      else if (p_ep->type == USB_CORE_EP_TYPE_ISOC)
      {
        /* Only single packet transfer supported in FS */
        p_ep->xfer_length = 0U;
      }
      else
      {
        return USB_CORE_ERROR;
      }
    }

    PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_VALID);
  }

  return USB_CORE_OK;
}


/**
  * @brief  Set a stall condition over an EP
  * @param  instance Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval HAL status
  */
usb_core_status_t USB_DRD_SetEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;

  /* Get Endpoint Physical number */
  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_STALL);
  }
  else
  {
    PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_STALL);
  }

  return USB_CORE_OK;
}

/**
  * @brief  Clear a stall condition over an EP
  * @param  instance Selected device
  * @param  p_ep pointer to endpoint structure
  * @retval HAL status
  */
usb_core_status_t USB_DRD_ClearEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;

  /* Get Endpoint Physical number */
  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    PCD_CLEAR_TX_DTOG(instance, phy_ep_num);

    if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
    {
      /* Configure NAK status for all non ISOC Endpoint */
      PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_NAK);
    }
  }
  else
  {
    PCD_CLEAR_RX_DTOG(instance, phy_ep_num);

