STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
    /* Configure VALID status for the Endpoint */
    PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_VALID);
  }

  return USB_CORE_OK;
}

/**
   * @brief  Stop transfer on an EP
   * @param  instance  usb device instance
   * @param  p_ep pointer to endpoint structure
   * @retval HAL status
   */
usb_core_status_t USB_DRD_StopEndpointXfer(uint32_t instance, const usb_core_ep_t *p_ep)
{
  usb_core_phy_ep_t phy_ep_num;

  if ((uint8_t)p_ep->num > USB_DRD_MAX_CHEP_NBR)
  {
    return USB_CORE_ERROR;
  }

  /* Get Endpoint Physical number */
  phy_ep_num = (usb_core_phy_ep_t)p_ep->num;

  /* IN endpoint */
  if (p_ep->dir == USB_CORE_EP_IN_DIR)
  {
    if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
      {
        /* Configure NAK status for all non ISOC Endpoint */
        PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_NAK);
      }
      else
      {
        /* Configure TX for ISOC Endpoint to disabled state */
        PCD_SET_EP_TX_STATUS(instance, phy_ep_num, USB_EP_TX_DIS);
      }
    }
  }
  else /* OUT endpoint */
  {
    if (p_ep->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      if (p_ep->type != USB_CORE_EP_TYPE_ISOC)
      {
        /* Configure NAK status for all non ISOC Endpoint */
        PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_NAK);
      }
      else
      {
        /* Configure RX for ISOC Endpoint to disabled state */
        PCD_SET_EP_RX_STATUS(instance, phy_ep_num, USB_EP_RX_DIS);
      }
    }
  }

  return USB_CORE_OK;
}
/**
  * @}
  */


/** @defgroup USB_DRD_CORE_Host_Exported_Functions USB Core Host Low Layer Exported Functions
  * @{
  */

/**
  * @brief  Initialize the USB DRD controller registers
  *         for Host mode
  * @param  instance Selected device
  * @param  p_core_config USB Instance configuration parameters
  *         for the specified USB peripheral.
  * @retval HAL status
  */
usb_core_status_t USB_DRD_InitHost(uint32_t instance, const usb_core_config_params_t *p_core_config)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  /* Clear All Pending Interrupt */
  p_usb->ISTR = 0U;

  /* Disable all interrupts */
  p_usb->CNTR &= ~(USB_CNTR_CTRM | USB_CNTR_PMAOVRM | USB_CNTR_ERRM |
                   USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_DCON |
                   USB_CNTR_SOFM | USB_CNTR_ESOFM | USB_CNTR_L1REQM);

  /* Clear All Pending Interrupt */
  p_usb->ISTR = 0U;

  /* Set the PullDown on the PHY */
  p_usb->BCDR |= USB_BCDR_DPPD;

  /* Enable Global interrupt */
  p_usb->CNTR |= (USB_CNTR_CTRM | USB_CNTR_PMAOVRM | USB_CNTR_ERRM |
                  USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_DCON |
                  USB_CNTR_SOFM | USB_CNTR_ESOFM | USB_CNTR_L1REQM);

  /* Init PMA Address */
  (void)USB_DRD_PMAReset();

  /* Isochronous Ep single buffer state */
  ep_db_state.is_iso_db = (usb_drd_doublebuffer_t)p_core_config->iso_db_state;

  /* Bulk Ep double buffer state  */
  ep_db_state.is_bulk_db = (usb_drd_doublebuffer_t)p_core_config->bulk_db_state;

  return USB_CORE_OK;
}

/**
  * @brief  Initialize the USB DRD HCD Driver
  * @param  p_driver pointer USB HCD driver structure
  * @retval HAL status
  */
usb_core_status_t USB_DRD_HCD_InitDriver(usb_core_hcd_driver_t *p_driver)
{
  p_driver->core_init = USB_DRD_InitCore;
  p_driver->core_deinit = USB_DRD_DeInitCore;
  p_driver->core_set_mode = USB_DRD_SetCurrentMode;
  p_driver->core_get_mode = USB_DRD_GetCurrentMode;
  p_driver->core_enable_interrupts = USB_DRD_EnableGlobalInterrupt;
  p_driver->core_disable_interrupts = USB_DRD_DisableGlobalInterrupt;
  p_driver->core_get_dma_status = USB_DRD_GetDmaStatus;
  p_driver->host_init = USB_DRD_InitHost;
  p_driver->host_start = USB_DRD_StartHost;
  p_driver->host_stop = USB_DRD_StopHost;
  p_driver->host_channel_init = USB_DRD_InitChannel;
  p_driver->host_channel_start = USB_DRD_StartChannelXfer;
  p_driver->host_channel_halt = USB_DRD_HaltChannel;
  p_driver->host_channel_close = USB_DRD_CloseChannel;
  p_driver->host_port_reset = USB_DRD_PortReset;
  p_driver->host_port_suspend = USB_DRD_PortSuspend;
  p_driver->host_port_resume = USB_DRD_PortResume;
  p_driver->host_get_current_frame = USB_DRD_GetCurrentFrame;
  p_driver->host_get_port_speed = USB_DRD_GetHostPortSpeed;

  return USB_CORE_OK;
}

/**
  * @brief  Set the channel Kind (Single/double buffer mode)
  * @param  instance Selected host
  * @param  phy_ch_num physical channel number
  * @param  db_status double state can be USB_DRD_XXX_DBUFF_ENBALE/USB_DRD_XXX_DBUFF_DISABLE
  * @retval HAL status
  */
usb_core_status_t USB_DRD_SetChannelDoubleBuffer(uint32_t instance, usb_core_phy_chep_t phy_ch_num,
                                                 usb_drd_db_status_t db_status)
{
  uint32_t ch_reg;

  if ((db_status == USB_DRD_BULK_DB_ENBALE) || (db_status == USB_DRD_ISOC_DB_DISABLE))
  {
    ch_reg = (USB_DRD_GET_CHEP(instance, phy_ch_num) | USB_CH_KIND) & USB_CHEP_DB_MSK;
  }
  else
  {
    ch_reg = USB_DRD_GET_CHEP(instance, phy_ch_num) & (~USB_CH_KIND) & USB_CHEP_DB_MSK;
  }

  /* Set the device speed in case using HUB FS with device LS */
  USB_DRD_SET_CHEP(instance, phy_ch_num, ch_reg);

  return USB_CORE_OK;
}

/**
  * @brief  Initialize a host channel
  * @param  instance Selected host
  * @param  p_ch pointer to host Channel structure
  * @retval DRD Core status
  */
usb_core_status_t USB_DRD_InitChannel(uint32_t instance, usb_core_ch_t *p_ch)
{
  usb_core_status_t status = USB_CORE_OK;
  usb_core_port_speed_t host_port_speed;
  uint32_t ch_reg;
  uint32_t phy_channel;
  uint32_t used_channel;
  usb_core_ep_direction_t ep_dir = (usb_core_ep_direction_t)p_ch->ch_dir;

  if (p_ch->ch_num > USB_CORE_CHANNEL_15)
  {
    return USB_CORE_ERROR;
  }

  if ((p_ch->ep_num == USB_CORE_ENDPOINT_0) && (chep0.is_dual_allocated != 0U))
  {
    p_ch->pma_address = chep0.pma_address;
    p_ch->pma_addr0 = chep0.pma_addr0;
    p_ch->pma_addr1 = chep0.pma_addr1;

    phy_chin_state[0U] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                         ((uint16_t)p_ch->ep_type + 1U) |
                         ((uint16_t)p_ch->ep_num << 8U);

