STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
    phy_chout_state[0U] = (((uint16_t)p_ch->ch_num + 1U) << 4U) |
                          ((uint16_t)p_ch->ep_type + 1U) |
                          ((uint16_t)p_ch->ep_num << 8U);

  }

  /* Check if the logical channel are already allocated */
  used_channel = USB_DRD_IsUsedChannel(p_ch->ch_num);

  /* Check if the channel is not already opened */
  if (used_channel == 0U)
  {
    /* Allocate New Physical channel */
    p_ch->phy_ch_num = USB_DRD_GetFreePhysicalChannel(p_ch);

    /* No free Channel available, return error */
    if (p_ch->phy_ch_num == USB_CORE_PHY_CHEP_FF)
    {
      return USB_CORE_ERROR;
    }
  }
  /* Channel already opened */
  else
  {
    /* Get Physical Channel number */
    phy_channel = (uint32_t)((used_channel & 0xF0U) >> 4U);
    p_ch->phy_ch_num = (usb_core_phy_chep_t)phy_channel;
  }

  if (ep_dir == USB_CORE_EP_IN_DIR)
  {
    p_ch->ch_dir = USB_CORE_CH_IN_DIR;
  }
  else
  {
    p_ch->ch_dir = USB_CORE_CH_OUT_DIR;
  }

  /* Check if the channel is not already opened */
  if (used_channel == 0U)
  {
    if (((p_ch->ep_type == USB_CORE_EP_TYPE_ISOC) && (ep_db_state.is_iso_db == USB_DRD_DBL_BUF))
        || ((p_ch->ep_type == USB_CORE_EP_TYPE_BULK) && (ep_db_state.is_bulk_db == USB_DRD_DBL_BUF)))
    {
      /* PMA Dynamic Allocation */
      status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_DBL_BUF);

      if (status == USB_CORE_ERROR)
      {
        return USB_CORE_ERROR;
      }

      /* Clear Channel DTOG_TX */
      HCD_CLEAR_TX_DTOG(instance, p_ch->phy_ch_num);

      /* Clear Channel DTOG RX */
      HCD_CLEAR_RX_DTOG(instance, p_ch->phy_ch_num);
    }
    else
    {
      if (p_ch->ep_num != USB_CORE_ENDPOINT_0)
      {
        status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

        if (status == USB_CORE_ERROR)
        {
          return USB_CORE_ERROR;
        }
      }
      else
      {
        if (p_ch->ch_num == USB_CORE_CHANNEL_0)
        {
          if ((chep0.virtual_ch_num != USB_CORE_CHANNEL_0) && (chep0.dir == USB_CORE_EP_IN_DIR))
          {
            if (p_ch->ch_dir == USB_CORE_CH_OUT_DIR)
            {
              status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

              if (status == USB_CORE_ERROR)
              {
                return USB_CORE_ERROR;
              }
            }
            else
            {
              return USB_CORE_ERROR;
            }
          }
          else
          {
            /* This is a dual EP0 PMA allocation */
            chep0.is_dual_allocated = 0x1U;

            /* PMA Dynamic Allocation for EP0 OUT direction */
            p_ch->ch_dir = USB_CORE_CH_OUT_DIR;
            status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

            if (status == USB_CORE_ERROR)
            {
              return USB_CORE_ERROR;
            }

            /* PMA Dynamic Allocation for EP0 IN direction */
            p_ch->ch_dir = USB_CORE_CH_IN_DIR;
            status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

            if (status == USB_CORE_ERROR)
            {
              return USB_CORE_ERROR;
            }
          }
        }
        else
        {
          if (chep0.is_allocated == 1U)
          {
            if (chep0.dir == USB_CORE_EP_IN_DIR)
            {
              p_ch->pma_addr1 = chep0.pma_addr1;
            }
            else
            {
              p_ch->pma_addr0 = chep0.pma_addr0;
            }
          }
          else
          {
            status = USB_DRD_PMAlloc(p_ch, (uint16_t)USB_DRD_SNG_BUF);

            if (status == USB_CORE_ERROR)
            {
              return USB_CORE_ERROR;
            }
          }
        }
      }
    }
  }

  if (ep_dir == USB_CORE_EP_IN_DIR)
  {
    p_ch->ch_dir = USB_CORE_CH_IN_DIR;

    if (p_ch->ep_num == USB_CORE_ENDPOINT_0)
    {
      p_ch->pma_address = p_ch->pma_addr1;
    }
  }
  else
  {
    p_ch->ch_dir = USB_CORE_CH_OUT_DIR;

    if (p_ch->ep_num == USB_CORE_ENDPOINT_0)
    {
      p_ch->pma_address = p_ch->pma_addr0;
    }
  }

  ch_reg = USB_DRD_GET_CHEP(instance, p_ch->phy_ch_num) & USB_CH_T_MASK;

  /* Initialize host Channel */
  switch (p_ch->ep_type)
  {
    case USB_CORE_EP_TYPE_CTRL:
      ch_reg |= USB_EP_CONTROL;
      break;

    case USB_CORE_EP_TYPE_BULK:
      ch_reg |= USB_EP_BULK;
      break;

    case USB_CORE_EP_TYPE_INTR:
      ch_reg |= USB_EP_INTERRUPT;
      break;

    case USB_CORE_EP_TYPE_ISOC:
      ch_reg |= USB_EP_ISOCHRONOUS;
      break;

    default:
      status = USB_CORE_ERROR;
      break;
  }

  /* Clear device address, Endpoint number and Low Speed Endpoint fields */
  ch_reg &= ~(USB_CHEP_DEVADDR |
              USB_CHEP_ADDR |
              USB_CHEP_LSEP |
              USB_CHEP_NAK |
              USB_CHEP_KIND |
              USB_CHEP_ERRTX |
              USB_CHEP_ERRRX |
              (0xFUL << 27));

  /* Set device address and Endpoint number associated to the channel */
  ch_reg |= (((uint32_t)p_ch->dev_addr << USB_CHEP_DEVADDR_Pos) |
             (uint32_t)p_ch->ep_num);

  /* Get Host core Speed */
  host_port_speed = USB_DRD_GetHostPortSpeed(instance);

  /* Set the device speed in case using HUB FS with device LS */
  if ((p_ch->speed == USB_CORE_DEVICE_SPEED_LS) && (host_port_speed == USB_CORE_PORT_SPEED_FS))
  {
    ch_reg |= USB_CHEP_LSEP;
  }

  /* Update the channel register value */
  USB_DRD_SET_CHEP(instance, p_ch->phy_ch_num, (ch_reg | USB_CH_VTRX | USB_CH_VTTX));

  /* Check single buffer for isochronous channel */
  if (p_ch->ep_type == USB_CORE_EP_TYPE_ISOC)
  {
    if (ep_db_state.is_iso_db != USB_DRD_DBL_BUF)
    {
      (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_ISOC_DB_DISABLE);
    }
  }

  /* Bulk double buffer check */
  if (p_ch->ep_type == USB_CORE_EP_TYPE_BULK)
  {
    if (ep_db_state.is_bulk_db == USB_DRD_DBL_BUF)
    {
      (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_BULK_DB_ENBALE);
    }
  }

  return status;
}

/**
  * @brief  Close a host channel
  * @param  instance Selected host
  * @param  p_ch pointer to host Channel structure
  * @retval DRD Core status
  */
usb_core_status_t USB_DRD_CloseChannel(uint32_t instance, usb_core_ch_t *p_ch)
{
  usb_core_status_t status = USB_CORE_OK;

  /* Stop the channel */
  (void)USB_DRD_HaltChannel(instance, p_ch);

