STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
  {
    /* Free Allocated Channel */
    phy_chin_state[p_ch->phy_ch_num] = 0U;
  }
  else
  {
    /* Free Allocated Channel */
    phy_chout_state[p_ch->phy_ch_num] = 0U;
  }

  /* Reset PMA Channel_Allocation */
  (void)USB_DRD_PMADeAlloc(p_ch);

  return status;
}

/**
  * @brief  Halt a host channel.
  * @param  instance Selected host
  * @param  p_ch pointer to host Channel structure
  * @retval HAL status
  */
usb_core_status_t USB_DRD_HaltChannel(uint32_t instance, const usb_core_ch_t *p_ch)
{
  usb_core_status_t status = USB_CORE_OK;

  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)
  {
    (void)USB_DRD_HaltInChannel(instance, p_ch->phy_ch_num);
  }
  else
  {
    (void)USB_DRD_HaltOutChannel(instance, p_ch->phy_ch_num);
  }

  return status;
}

/**
  * @brief  Start a transfer over a host channel
  * @param  instance Selected host
  * @param  p_ch pointer to host channel structure
  * @retval DRD Core status
  */
usb_core_status_t USB_DRD_StartChannelXfer(uint32_t instance, usb_core_ch_t *p_ch)
{
  uint32_t length;
  uint32_t ch_reg = USB_DRD_GET_CHEP(instance, p_ch->phy_ch_num);

  if (p_ch->ch_dir == USB_CORE_CH_IN_DIR)  /* In Channel */
  {
    /* Multi packet transfer */
    if (p_ch->xfer_length > p_ch->max_packet)
    {
      length = p_ch->max_packet;
    }
    else
    {
      length = p_ch->xfer_length;
    }

    if (p_ch->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      if ((p_ch->ep_type == USB_CORE_EP_TYPE_BULK)
          || (p_ch->ep_type == USB_CORE_EP_TYPE_INTR))
      {
        USB_DRD_CLEAR_RX_DTOG(instance, p_ch->phy_ch_num);

        /* Set Data PID */
        if (p_ch->data_pid == USB_CORE_CH_PID_DATA1)
        {
          USB_DRD_RX_DTOG(instance, p_ch->phy_ch_num);
        }
      }

      /* Set RX buffer count */
      USB_DRD_SET_CHEP_RX_CNT(instance, p_ch->phy_ch_num, length);
    }
    else if (p_ch->ep_type == USB_CORE_EP_TYPE_BULK)
    {
      /* Double buffer activated */
      if ((p_ch->xfer_length > p_ch->max_packet))
      {
        (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_BULK_DB_ENBALE);

        /* Set the Double buffer counter */
        USB_DRD_SET_CHEP_DBUF0_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_OUT_DIR, length);
        USB_DRD_SET_CHEP_DBUF1_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_OUT_DIR, length);
      }
      else  /* Switch to single buffer mode */
      {
        (void)USB_DRD_SetChannelDoubleBuffer(instance, p_ch->phy_ch_num, USB_DRD_BULK_DB_DISABLE);

        /* Set RX buffer count */
        USB_DRD_SET_CHEP_RX_CNT(instance, p_ch->phy_ch_num, length);
      }
    }
    else  /* Isochronous */
    {
      /* Set the Double buffer counter */
      USB_DRD_SET_CHEP_DBUF0_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_OUT_DIR, length);
      USB_DRD_SET_CHEP_DBUF1_CNT(instance, p_ch->phy_ch_num, USB_CORE_EP_OUT_DIR, length);
    }

    /* Enable host channel */
    USB_DRD_SET_CHEP_RX_STATUS(instance, p_ch->phy_ch_num, USB_CH_RX_VALID);
  }
  else   /* Out Channel */
  {
    /* Multi packet transfer */
    if (p_ch->xfer_length > p_ch->max_packet)
    {
      length = p_ch->max_packet;
    }
    else
    {
      length = p_ch->xfer_length;
    }

    /* Configure and validate Tx endpoint */
    if (p_ch->double_buffer_en == (uint8_t)USB_CORE_CONFIG_DISABLED)
    {
      USB_DRD_WritePMA(instance, p_ch->p_xfer_buffer, p_ch->pma_address, (uint16_t)length);
      USB_DRD_SET_CHEP_TX_CNT(instance, p_ch->phy_ch_num, (uint16_t)length);

      /* SET PID SETUP */
      if (p_ch->data_pid == USB_CORE_CH_PID_SETUP)
      {
        USB_DRD_CHEP_TX_SETUP(instance, p_ch->phy_ch_num);
      }

      if ((p_ch->ep_type == USB_CORE_EP_TYPE_BULK)
          || (p_ch->ep_type == USB_CORE_EP_TYPE_INTR))
      {
        USB_DRD_CLEAR_TX_DTOG(instance, p_ch->phy_ch_num);

        /* Set Data PID */
        if (p_ch->data_pid == USB_CORE_CH_PID_DATA1)
        {
          USB_DRD_TX_DTOG(instance, p_ch->phy_ch_num);
        }
      }
    }
    else if (p_ch->ep_type == USB_CORE_EP_TYPE_BULK)
    {
      (void)USB_DRD_CH_BULK_DB_StartXfer(instance, p_ch, ch_reg, &length);
    }
    else
    {
      (void)USB_DRD_CH_ISO_DB_StartXfer(instance, p_ch, length);
    }

    /* Enable host channel */
    USB_DRD_SET_CHEP_TX_STATUS(instance, p_ch->phy_ch_num, USB_CH_TX_VALID);
  }

  return USB_CORE_OK;
}

/**
  * @brief  Halt a host channel in
  * @param  instance Selected device
  * @param  phy_ch_num physical host Channel number
  *         This parameter can be a value from 1 to 15
  * @retval status
  */
usb_core_status_t USB_DRD_HaltInChannel(uint32_t instance, usb_core_phy_chep_t phy_ch_num)
{
  /* Set disable to Channel */
  USB_DRD_SET_CHEP_RX_STATUS(instance, phy_ch_num, USB_CH_RX_DIS);

  return USB_CORE_OK;
}

/**
  * @brief  Halt a host channel out
  * @param  instance Selected device
  * @param  phy_ch_num physical host Channel number
  *         This parameter can be a value from 1 to 15
  * @retval status
  */
usb_core_status_t USB_DRD_HaltOutChannel(uint32_t instance, usb_core_phy_chep_t phy_ch_num)
{
  /* Set disable to Channel */
  USB_DRD_SET_CHEP_TX_STATUS(instance, phy_ch_num, USB_CH_TX_DIS);

  return USB_CORE_OK;
}

/**
  * @brief  Start Host Core
  * @param  instance Selected device
  * @retval status
  */
usb_core_status_t USB_DRD_StartHost(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  __IO uint32_t count = USB_DRD_PDWN_EXIT_CNT;

  /* Remove PowerDown */
  p_usb->CNTR &= ~USB_CNTR_PDWN;

  /* Few cycles to ensure exit from powerdown */
  while (count > 0U)
  {
    count--;
  }

  /* Clear Reset */
  p_usb->CNTR &= ~USB_CNTR_USBRST;

  return USB_CORE_OK;
}

/**
  * @brief  Stop Host Core
  * @param  instance Selected device
  * @retval status
  */
usb_core_status_t USB_DRD_StopHost(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  p_usb->ISTR &= ~(USB_ISTR_DIR | USB_ISTR_L1REQ |
                   USB_ISTR_ESOF | USB_ISTR_SOF |
                   USB_ISTR_RESET | USB_ISTR_DCON |
                   USB_ISTR_SUSP | USB_ISTR_WKUP |
                   USB_ISTR_ERR | USB_ISTR_PMAOVR |
                   USB_ISTR_CTR);

  /* Set PowerDown */
  p_usb->CNTR |= USB_CNTR_PDWN;

  /* Force a Reset */
  p_usb->CNTR |= USB_CNTR_USBRST;

  /* Clear all allocated virtual channels */
  USB_DRD_ClearPhysicalChannels();

  /* Reset the PMA current pointer */
  (void)USB_DRD_PMAReset();

  return USB_CORE_OK;
}

/**
  * @brief  Get a Logical Channel number from  physical Channel
  * @param  phy_ch_num
  *         This parameter can be a value from 0 to 7
  * @param  ch_dir  Channel direction
  *         -0 OUT_Channel
  *         -1 IN_Channel
  * @retval Channel number
  */
usb_core_channel_t USB_DRD_GetLogicalChannel(usb_core_phy_chep_t phy_ch_num, usb_core_ch_direction_t ch_dir)
{
  uint16_t logical_channel;

  /* Out Channel Direction */
  if (ch_dir == USB_CORE_CH_OUT_DIR)
  {
    if (((phy_chout_state[phy_ch_num] & 0x00F0U) >> 4U) != 0U)
    {
      logical_channel = ((phy_chout_state[phy_ch_num] & 0x00F0U) >> 4U) - 1U;
      return (usb_core_channel_t)logical_channel;
    }
    else
    {
      /* Channel not registered Error */
      return USB_CORE_CHANNEL_FF;
    }
  }
  /* IN Channel Direction */
  else
  {
    if (((phy_chin_state[phy_ch_num] & 0x00F0U) >> 4U) != 0U)
    {
      logical_channel = ((phy_chin_state[phy_ch_num] & 0x00F0U) >> 4U) - 1U;
      return (usb_core_channel_t)logical_channel;
    }
    else
    {
      /* Channel not registered Error */
      return USB_CORE_CHANNEL_FF;
    }
  }
}

/**
  * @brief  Free All Channel allocation
  */
void USB_DRD_ClearPhysicalChannels(void)
{
  uint8_t idx;

