STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_usb_drd_core.c
  for (idx = 0U; idx < USB_DRD_MAX_CHEP_NBR; idx++)
  {
    /* Reset channel allocation value */
    phy_chout_state[idx] = 0U;
    phy_chin_state[idx] = 0U;
  }
}

/**
  * @brief  Put the Device in suspend mode
  * @param  instance Selected device
  * @retval DRD Core status
  */
usb_core_status_t USB_DRD_PortSuspend(uint32_t instance)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);
  __IO uint32_t count = 0U;

  /* Set Suspend Mode */
  p_usb->CNTR |= USB_CNTR_SUSPEN;

  /* Wait for Suspend Ready */
  while ((p_usb->CNTR & USB_CNTR_SUSPRDY) == 0U)
  {
    if (++count > USB_DRD_TIMEOUT)
    {
      return USB_CORE_ERROR;
    }
  }

  return USB_CORE_OK;
}

/**
  * @brief  Resume Host Port
  * @param  instance  Selected device
  * @param  resume_status  resume status
  * @retval HAL status
  */
usb_core_status_t USB_DRD_PortResume(uint32_t instance, usb_core_port_resume_sts_t resume_status)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  if (resume_status == USB_CORE_PORT_RESUME_STS_SET)
  {
    /* Set Resume bit */
    p_usb->CNTR |= USB_CNTR_L2RES;
  }
  else
  {
    /* Clear Resume bit */
    p_usb->CNTR &= ~USB_CNTR_L2RES;
  }

  return USB_CORE_OK;
}

/**
  * @brief  USB_DRD_Port_Reset : Reset Host Port
  * @param  instance Selected device
  * @param  reset_status reset status
  * @retval HAL status
  * @note (1)The application must wait at least 10 ms
  *   before clearing the reset bit.
  */
usb_core_status_t USB_DRD_PortReset(uint32_t instance, usb_core_port_reset_sts_t reset_status)
{
  usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  if (reset_status == USB_CORE_PORT_RESET_STS_SET)
  {
    /* Force USB Reset */
    p_usb->CNTR |= USB_CNTR_USBRST;
  }
  else
  {
    /* Release USB Reset */
    p_usb->CNTR &= ~USB_CNTR_USBRST;
  }

  return USB_CORE_OK;
}

/**
  * @brief  Return Host Core speed
  * @param  instance Selected host
  * @retval speed Host port speed
  *          This parameter can be one of these values
  *          USB_CORE_PORT_SPEED_FS Full speed mode
  *          USB_CORE_PORT_SPEED_LS Low speed mode
  */
usb_core_port_speed_t USB_DRD_GetHostPortSpeed(uint32_t instance)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  if ((p_usb->ISTR & USB_ISTR_LS_DCONN) != 0U)
  {
    return USB_CORE_PORT_SPEED_LS;
  }
  else
  {
    return USB_CORE_PORT_SPEED_FS;
  }
}

/**
  * @brief  Return Host Current Frame number
  * @param  instance Selected host
  * @retval current frame number
  */
uint32_t USB_DRD_GetCurrentFrame(uint32_t instance)
{
  const usb_drd_global_t *p_usb = USB_DRD_GET_INSTANCE(instance);

  return p_usb->FNR & 0x7FFU;
}

/**
  * @brief  USB_DRD_GetDmaStatus: return the HCD DMA status enabled or disabled
  * @param  instance  Selected device
  * @retval HCD DMA status enabled or disabled
  */
uint32_t USB_DRD_GetDmaStatus(uint32_t instance)
{
  STM32_UNUSED(instance);

  return (uint32_t)USB_CORE_CONFIG_DISABLED;
}
/**
  * @}
  */
/**
  * @}
  */

#endif /* defined (USB_DRD_FS) */

/**
  * @}
  */
